{
  "ChannelName": "codingwithscott",
  "BotAccountName": "codingwithscottbot",
  "TwitchToken": "",
  "BotDisplayName": "CodingWithScottBot",
  "HandleHostRaidSubscriptionEvents": "true",
  "ChatMessages": [
    {
      "TriggerWords": [ "GitHub" ],
      "Responses": [ "My GitHub repos: https://github.com/ScottLilly https://github.com/SOSCSRPG" ]
    },
    {
      "TriggerWords": [ "Website", "Websites" ],
      "Responses": [ "My websites: https://ScottLilly.com https://SOSCSRPG.com" ]
    },
    {
      "TriggerWords": [ "RPG" ],
      "Responses": [ "WPF RPG guide: https://SOSCSRPG.com/" ]
    },
    {
      "TriggerWords": [ "DesignPatterns" ],
      "Responses": [ "C# Design Patterns: https://ScottLilly.com/c-design-patterns/" ]
    },
    {
      "TriggerWords": [ "Rigged" ],
      "Responses": [ "Of course the games are rigged ;)" ]
    },
    {
      "TriggerWords": [ "Social" ],
      "Responses": [ "https://twitter.com/scottlilly" ]
    },
    {
      "TriggerWords": [ "Music" ],
      "Responses": [ "https://www.instafluff.tv/ComfyJazz/?channel=CodingWithScott" ]
    },
    {
      "TriggerWords": [ "DadJoke" ],
      "Responses": [
        "I don’t trust stairs. They are always up to something.",
        "When does a joke become a 'dad joke?' When it becomes apparent.",
        "I sold our vacuum cleaner; it was just gathering dust.",
        "I searched for a lighter on Amazon, but all I could find was 401 matches.",
        "A friend of mine didn't pay his exorcist. He got repossessed.",
        "What’s the best way to watch a fly-fishing tournament? Live stream.",
        "Why do dogs float in water? Because they are good buoys.",
        "Why do cows wear bells? Because their horns don't work.",
        "Did you hear about the restaurant on the moon? Great food, no atmosphere!",
        "Did you hear the rumor about butter? Well, I'm not going to spread it!",
        "What do you call a bear with no teeth? A gummy bear.",
        "Q: If athletes get athlete's foot, what do astronauts get? A: Missile toe.",
        "If you see a robbery at an Apple Store does that make you an iWitness?",
        "What’s orange and sounds like a parrot? A carrot.",
        "What’s brown and sticky? A stick.",
        "How you fix a broken pumpkin? With a pumpkin patch.",
        "I hated facial hair but then it grew on me.",
        "How do you throw a party in outer space? You planet.",
        "You can't trust atoms. They make up everything!",
        "If a child refuses to nap, are they guilty of resisting a rest?",
        "Can a kangaroo jump higher than a house? Of course, houses can't jump."
      ]
    },
    {
      "TriggerWords": [ "8ball" ],
      "Responses": [
        "It is certain",
        "It is decidedly so",
        "Without a doubt",
        "Yes definitely",
        "You may rely on it",
        "As I see it, yes",
        "Most likely",
        "Outlook good",
        "Yes",
        "Signs point to yes",
        "Reply hazy, try again",
        "Ask again later",
        "Better not tell you now",
        "Cannot predict now",
        "Concentrate and ask again",
        "Don't count on it",
        "My reply is no",
        "My sources say no",
        "Outlook not so good",
        "Very doubtful"
      ]
    },
    {
      "TriggerWords": [ "Quote" ],
      "Responses": [
        "The best way to predict the future is to invent it. - Alan Kay",
        "Programs must be written for people to read, and only incidentally for machines to execute. - Harold Abelson",
        "Any fool can write code that a computer can understand. Good programmers write code that humans understand. - Martin Fowler",
        "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live. - John Woods",
        "I'm not a great programmer; I'm just a good programmer with great habits. - Kent Beck",
        "Weeks of programming can save you hours of planning. - Unknown",
        "Code is there to explain the comments to the computer. - Andy Harris",
        "Some people, when confronted with a problem, think 'I know, I'll user regular expressions.' Now they have two problems. - Jamie Zawinski",
        "Slow is smooth. Smooth is fast. - Mitsuyo Maeda",
        "The future is already here - it's just not evenly distributed. - William Gibson",
        "When you want to know how things really work, study them when they're falling apart. - William Gibson",
        "The street finds its own use for things. - William Gibson",
        "See, the world is full of things more powerful than us. But if you know how to catch a ride, you can go places. - Neal Stephenson",
        "Well, all information looks like noise until you break the code. - Neal Stephenson",
        "Your assumptions are your windows on the world. Scrub them off every once and a while, or the light won't come in. - Isaac Asimov",
        "Those people who think they know everything are a great annoyance to those of us who do. - Isaac Asimov",
        "Never attempt to teach a pig to sing; it wastes your time and annoys the pig. - Robert Heinlein",
        "There ain't no such thing as a free lunch. - Robert Heinlein",
        "Always listen to experts. They'll tell you what can't be done, and why. Then do it. - Robert Heinlein",
        "A society that gets rid of all its troublemakers goes downhill. - Robert Heinlein",
        "Cats are intended to teach us that not everything in nature has a function. - Garrison Keillor",
        "Experience is a hard teacher because she gives you the test first, the lesson afterwards. - Vernon Sanders Law",
        "It is not a shame for a man to learn that which he knows not, whatever his age. - Socrates",
        "Do not mess with science - we have lasers! - The Optical Society",
        "Everywhere is walking distance if you have the time. - Steven Wright",
        "Doing your best is more important than being the best. - Zig Ziglar",
        "An expert is somebody who knows more and more about less and less. - Unknown",
        "To the man who only has a hammer, everything he encounters begins to look like a nail. - Abraham Maslow",
        "We are what we repeatedly do; excellence, then, is not an act but a habit. - Aristotle",
        "The cure for boredom is curiosity. There is no cure for curiosity. - Ellen Parr",
        "You must be the change you wish to see in the world. - Gandhi",
        "We've heard that a million monkeys at a million keyboards could produce the complete works of Shakespeare; now, thanks to the Internet, we know that is not true. - Robert Wilensky",
        "You miss 100 percent of the shots you never take. - Wayne Gretzky",
        "Imagination is more important than knowledge. - Albert Einstein",
        "Make it as simple as possible but no simpler. - Albert Einstein",
        "You can't solve a problem with the same kind of thinking that created it. - Albert Einstein",
        "It's difficult to work in a group when you're omnipotent. - Q from Star Trek",
        "Everything starts as somebody's daydream - Larry Niven",
        "Do what you can, with what you have, where you are. - Theodore Roosevelt",
        "Always do right. This will gratify some people and astonish the rest. - Mark Twain",
        "Life is a do-it-yourself project. - Unknown",
        "Nothing endures but change. - Heraclitus",
        "A witty saying proves nothing. - Voltaire",
        "It has become appallingly obvious that our technology has exceeded our humanity. - Einstein Albert",
        "Do, or do not. There is no 'try'. - Yoda",
        "A mathematician is a device for turning coffee into theorems. - Paul Erdos"
      ]
    }
  ],
  "CounterMessages": [
    {
      "TriggerWords": [ "Scammed" ],
      "Responses": [ "Scott has scammed chat {counter} times!" ]
    },
    {
      "TriggerWords": [ "Doxxed" ],
      "Responses": [ "Scott has doxxed himself {counter} times!" ]
    }
  ], 
  "TimedMessages": {
    "IntervalInMinutes": "10",
    "Messages": [
      "Stay up-to-date by clicking the 'Follow' button. It's free!",
      "Type !commands to see a list of available chat commands",
      "!commands",
      "!quote"
    ]
  }
}