{
  "ChannelName": "codingwithscott",
  "BotAccountName": "codingwithscottbot",
  "BotDisplayName": "CodingWithScottBot",
  "HandleAlerts": "false",
  "Commands": [
    {
      "TriggerWords": [ "GitHub" ],
      "Responses": [ "My GitHub repos: https://github.com/ScottLilly https://github.com/SOSCSRPG" ]
    },
    {
      "TriggerWords": [ "Website", "Websites" ],
      "Responses": [ "My websites: https://ScottLilly.com https://SOSCSRPG.com" ]
    },
    {
      "TriggerWords": [ "RPG" ],
      "Responses": [ "WPF RPG guide: https://SOSCSRPG.com/" ]
    },
    {
      "TriggerWords": [ "DesignPatterns" ],
      "Responses": [ "C# Design Patterns: https://ScottLilly.com/c-design-patterns/" ]
    },
    {
      "TriggerWords": [ "Rigged" ],
      "Responses": [ "Of course the games are rigged ;)" ]
    },
    {
      "TriggerWords": [ "Social" ],
      "Responses": [ "https://twitter.com/scottlilly" ]
    },
    {
      "TriggerWords": [ "Music" ],
      "Responses": [ "https://www.instafluff.tv/ComfyJazz/?channel=CodingWithScott" ]
    },
    {
      "TriggerWords": [ "8ball" ],
      "Responses": [
        "It is certain",
        "It is decidedly so",
        "Without a doubt",
        "Yes definitely",
        "You may rely on it",
        "As I see it, yes",
        "Most likely",
        "Outlook good",
        "Yes",
        "Signs point to yes",
        "Reply hazy, try again",
        "Ask again later",
        "Better not tell you now",
        "Cannot predict now",
        "Concentrate and ask again",
        "Don't count on it",
        "My reply is no",
        "My sources say no",
        "Outlook not so good",
        "Very doubtful"
      ]
    },
    {
      "TriggerWords": [ "Quote" ],
      "Responses": [
        "The best way to predict the future is to invent it. - Alan Kay",
        "Programs must be written for people to read, and only incidentally for machines to execute. - Harold Abelson",
        "Any fool can write code that a computer can understand. Good programmers write code that humans understand. - Martin Fowler",
        "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live. - John Woods",
        "I'm not a great programmer; I'm just a good programmer with great habits. - Kent Beck",
        "Weeks of programming can save you hours of planning. - Unknown",
        "Code is there to explain the comments to the computer. - Andy Harris",
        "Some people, when confronted with a problem, think 'I know, I'll user regular expressions.' Now they have two problems. - Jamie Zawinski",
        "Slow is smooth. Smooth is fast. - Mitsuyo Maeda",
        "The future is already here - it's just not evenly distributed. - William Gibson",
        "When you want to know how things really work, study them when they're falling apart. - William Gibson",
        "The street finds its own use for things. - William Gibson",
        "See, the world is full of things more powerful than us. But if you know how to catch a ride, you can go places. - Neal Stephenson",
        "Well, all information looks like noise until you break the code. - Neal Stephenson",
        "Your assumptions are your windows on the world. Scrub them off every once and a while, or the light won't come in. - Isaac Asimov",
        "Those people who think they know everything are a great annoyance to those of us who do. - Isaac Asimov",
        "Never attempt to teach a pig to sing; it wastes your time and annoys the pig. - Robert Heinlein",
        "There ain't no such thing as a free lunch. - Robert Heinlein",
        "Always listen to experts. They'll tell you what can't be done, and why. Then do it. - Robert Heinlein",
        "A society that gets rid of all its troublemakers goes downhill. - Robert Heinlein"
      ]
    }
  ],
  "TimedMessages": {
    "IntervalInMinutes": "1",
    "Messages": [
      "Stay up-to-date by clicking the 'Follow' button. It's free!",
      "Type !commands to see a list of available chat commands",
      "!quote"
    ]
  }
}